Revit 2027 API
View3D.SaveOrientationAndLock Method
 Locks the view and saves its orientation
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SaveOrientationAndLock()
Public Sub SaveOrientationAndLock
public:
void SaveOrientationAndLock()
member SaveOrientationAndLock : unit -> unit
Exceptions
Exception | Condition
InvalidOperationException |  Returns true if the view is not a view template. -or- The orientation of the View3D cannot be saved.
See Also
Reference
View3D Class
Autodesk.Revit.DB Namespace